# ViewInAModelMustBeUniqueWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ViewSheetFailures..::..ViewInAModelMustBeUniqueWarn Property
BuiltInFailures..::..ViewSheetFailures Class See Also
---
Sheet views in this model cannot contain more than one instance of "%1!s!."
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ViewInAModelMustBeUniqueWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewInAModelMustBeUniqueWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ViewInAModelMustBeUniqueWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ViewSheetFailures Class
Autodesk.Revit.DB Namespace